content/wfc.org
#+Title: LZ 

#+BEGIN_EXPORT html
    <script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.js" type="application/javascript"></script>
    <script crossorigin src="https://unpkg.com/react@17/umd/react.production.min.js"></script>
    <script crossorigin src="https://unpkg.com/react-dom@17/umd/react-dom.production.min.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.reagent.js" type="application/javascript"></script>
<script src="code/wfc.cljs" type="application/x-scittle"></script>

  <body>
    <div id="app"></div>
  </body>
#+END_EXPORT

* WaveFunctionCollapse
WaveFunctionCollapse is a texture synthesis algorithm. It can be used to procedurally creating maps out of tile-sets based on adjacency rules. This post expounds a simplified version of it in CLJS. Let's make some RPG world maps using it.

* Setup
** Tiles
Firstly I grabbed a free tile-set from [[https://opengameart.org/content/16x16-overworld-tiles][opengamechart.org]]. They came as a single gif file so I converted it to a png and then had chatGPT write a script to split it into the 16x16 pixel tiles.

** Drawing a grid of tiles
Let's do some setup to show a css grid of tiles:

#+BEGIN_SRC clojure
(require '[reagent.core :as r]
         '[reagent.dom :as rdom])

(defn tile-grid [{:keys [tile-width-px n-columns]}
                tiles]
  (let [style {:display "grid"
               :width (str (* tile-width-px n-columns) "px")
               :grid-template-columns (str "repeat(auto-fill, "
                                           tile-width-px
                                           "px)")}]
    (into [:div {:style style}] tiles)))

(defn tile-img [{:keys [tile-img-path
                        width-px]}]
  [:img {:src tile-img-path
         :style {:width (str width-px "px")
                 :height (str width-px "px")
                 :max-width "100%"}}])
#+END_SRC

*** Pick out some tiles to use
I went through the tiles and picked out some water, coast and grassland tiles to start with. Let's generate a map from these:

#+BEGIN_SRC clojure
(def tile-dir "assets/tiles/")

(def tile-paths
  {:water (str tile-dir "tile_10_1.png")
   :grass (str tile-dir "tile_6_13.png")
   :grass-coast-w (str tile-dir "tile_9_1.png")
   :grass-coast-sw (str tile-dir "tile_9_2.png")
   :grass-coast-s (str tile-dir "tile_10_2.png")
   :grass-coast-e (str tile-dir "tile_11_1.png")
   :grass-coast-se (str tile-dir "tile_11_2.png")
   :grass-coast-ne (str tile-dir "tile_11_0.png")
   :grass-coast-n (str tile-dir "tile_10_0.png")
   :grass-coast-nw (str tile-dir "tile_9_0.png")})

(defn random-tile []
  [tile-img
   {:tile-img-path (-> tile-paths vals rand-nth)
    :width-px 16}])

(defn world []
  (let [tiles (take 25 (repeatedly random-tile))]
    [tile-grid
     {:tile-width-px 16
      :n-columns 5}
     tiles]))

(rdom/render
 [world]
 (.getElementById js/document "random-world"))
#+END_SRC

** A random world
Here is a random 5x5 world. It will change if you refresh the page. We can see that there are no adjacency rules here so the map doesn't really make sense. 
#+BEGIN_EXPORT html
<body>
  <div id="random-world"></div>
</body>
#+END_EXPORT


