public/wfc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LZ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type= "text/css" href="./styles.css"><link rel="icon"
       href="data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>👻</text></svg>"><header>
| <a href="./">home</a>
| <a href="#top">top</a>
|  <a href="https://github.com/larzeitlin">github</a>
| 👻
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LZ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d79394">WaveFunctionCollapse</a></li>
<li><a href="#org0224250">Setup</a>
<ul>
<li><a href="#orge5e31a9">Tiles</a></li>
<li><a href="#orgb426984">Drawing a grid of tiles</a>
<ul>
<li><a href="#orgca0cfd1">Pick out some tiles to use</a></li>
</ul>
</li>
<li><a href="#org4f6dc83">A random world</a></li>
</ul>
</li>
<li><a href="#orgddcd02b">Adjacency rules</a></li>
<li><a href="#orge1a9ecd">Applying the rules</a>
<ul>
<li><a href="#org5d7a90e">displaying it</a></li>
</ul>
</li>
<li><a href="#orgd24ef25">What next</a></li>
</ul>
</div>
</div>
    <script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.js" type="application/javascript"></script>
    <script crossorigin src="https://unpkg.com/react@17/umd/react.production.min.js"></script>
    <script crossorigin src="https://unpkg.com/react-dom@17/umd/react-dom.production.min.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.reagent.js" type="application/javascript"></script>
<script src="code/wfc.cljs" type="application/x-scittle"></script>

  <body>
    <div id="app"></div>
  </body>

<div id="outline-container-org3d79394" class="outline-2">
<h2 id="org3d79394">WaveFunctionCollapse</h2>
<div class="outline-text-2" id="text-org3d79394">
<p>
WaveFunctionCollapse is a texture synthesis algorithm. It can be used to procedurally creating maps out of tile-sets based on adjacency rules. This post expounds a simplified version of it in CLJS. Let's make some RPG world maps using it.
</p>
</div>
</div>

<div id="outline-container-org0224250" class="outline-2">
<h2 id="org0224250">Setup</h2>
<div class="outline-text-2" id="text-org0224250">
</div>
<div id="outline-container-orge5e31a9" class="outline-3">
<h3 id="orge5e31a9">Tiles</h3>
<div class="outline-text-3" id="text-orge5e31a9">
<p>
Firstly I grabbed a free tile-set from <a href="https://opengameart.org/content/16x16-overworld-tiles">opengamechart.org</a>. They came as a single gif file so I converted it to a png and then had chatGPT write a script to split it into the 16x16 pixel tiles.
</p>
</div>
</div>

<div id="outline-container-orgb426984" class="outline-3">
<h3 id="orgb426984">Drawing a grid of tiles</h3>
<div class="outline-text-3" id="text-orgb426984">
<p>
Let's do some setup to show a css grid of tiles:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #ffffff;">(</span>require '<span style="color: #ff62d4;">[</span>reagent.core <span style="color: #00bcff;">:as</span> r<span style="color: #ff62d4;">]</span>
         '<span style="color: #ff62d4;">[</span>reagent.dom <span style="color: #00bcff;">:as</span> rdom<span style="color: #ff62d4;">]</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">tile-grid</span> <span style="color: #ff62d4;">[</span><span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:keys</span> <span style="color: #fba849;">[</span>tile-width-px n-columns<span style="color: #fba849;">]</span><span style="color: #3fdfd0;">}</span>
                tiles<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>style <span style="color: #fba849;">{</span><span style="color: #00bcff;">:display</span> <span style="color: #79a8ff;">"grid"</span>
               <span style="color: #00bcff;">:width</span> <span style="color: #9f80ff;">(</span>str <span style="color: #4fe42f;">(</span>* tile-width-px n-columns<span style="color: #4fe42f;">)</span> <span style="color: #79a8ff;">"px"</span><span style="color: #9f80ff;">)</span>
               <span style="color: #00bcff;">:grid-template-columns</span> <span style="color: #9f80ff;">(</span>str <span style="color: #79a8ff;">"repeat(auto-fill, "</span>
                                           tile-width-px
                                           <span style="color: #79a8ff;">"px)"</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">}</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span>into <span style="color: #fba849;">[</span><span style="color: #00bcff;">:div</span> <span style="color: #9f80ff;">{</span><span style="color: #00bcff;">:style</span> style<span style="color: #9f80ff;">}</span><span style="color: #fba849;">]</span> tiles<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">tile-img</span> <span style="color: #ff62d4;">[</span><span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:keys</span> <span style="color: #fba849;">[</span>tile-img-path
                        width-px<span style="color: #fba849;">]</span><span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">[</span><span style="color: #00bcff;">:img</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:src</span> tile-img-path
         <span style="color: #00bcff;">:style</span> <span style="color: #fba849;">{</span><span style="color: #00bcff;">:width</span> <span style="color: #9f80ff;">(</span>str width-px <span style="color: #79a8ff;">"px"</span><span style="color: #9f80ff;">)</span>
                 <span style="color: #00bcff;">:height</span> <span style="color: #9f80ff;">(</span>str width-px <span style="color: #79a8ff;">"px"</span><span style="color: #9f80ff;">)</span>
                 <span style="color: #00bcff;">:max-width</span> <span style="color: #79a8ff;">"100%"</span><span style="color: #fba849;">}</span><span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">]</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgca0cfd1" class="outline-4">
<h4 id="orgca0cfd1">Pick out some tiles to use</h4>
<div class="outline-text-4" id="text-orgca0cfd1">
<p>
I went through the tiles and picked out some water, coast and grassland tiles to start with. Let's generate a map from these:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">tile-dir</span> <span style="color: #79a8ff;">"assets/tiles/"</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">tile-paths</span>
  <span style="color: #ff62d4;">{</span><span style="color: #00bcff;">:water</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_10_1.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_6_13.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-w</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_9_1.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-sw</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_9_2.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-s</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_10_2.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-e</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_11_1.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-se</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_11_2.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-ne</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_11_0.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-n</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_10_0.png"</span><span style="color: #3fdfd0;">)</span>
   <span style="color: #00bcff;">:grass-coast-nw</span> <span style="color: #3fdfd0;">(</span>str tile-dir <span style="color: #79a8ff;">"tile_9_0.png"</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">}</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">random-tile</span> <span style="color: #ff62d4;">[]</span>
  <span style="color: #ff62d4;">[</span>tile-img
   <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:tile-img-path</span> <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">-&gt;</span> tile-paths vals rand-nth<span style="color: #fba849;">)</span>
    <span style="color: #00bcff;">:width-px</span> 16<span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">]</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">world</span> <span style="color: #ff62d4;">[]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>tiles <span style="color: #fba849;">(</span>take 25 <span style="color: #9f80ff;">(</span>repeatedly random-tile<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">[</span>tile-grid
     <span style="color: #fba849;">{</span><span style="color: #00bcff;">:tile-width-px</span> 16
      <span style="color: #00bcff;">:n-columns</span> 5<span style="color: #fba849;">}</span>
     tiles<span style="color: #3fdfd0;">]</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">rdom</span>/render
 <span style="color: #ff62d4;">[</span>world<span style="color: #ff62d4;">]</span>
 <span style="color: #ff62d4;">(</span>.getElementById <span style="color: #6ae4b9;">js</span>/document <span style="color: #79a8ff;">"random-world"</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4f6dc83" class="outline-3">
<h3 id="org4f6dc83">A random world</h3>
<div class="outline-text-3" id="text-org4f6dc83">
<p>
Here is a random 5x5 world. It will change if you refresh the page. We can see that there are no adjacency rules here so the map doesn't really make sense. 
</p>
<body>
  <div id="random-world"></div>
</body>
</div>
</div>
</div>
