content/wfc.org
* Adjacency rules
We need a set of rules to see which tiles are allowed to go next to which. This can become quite painstaking if you do it by hand. The original WFC project has a tool to analyse existing valid maps and extract rules from them. Here we only have a few tiles and I don't have any example maps, so I've used a "sockets" approach whereby we match up tile types based on the content at positions on the corresponding edges of the tiles.

#+BEGIN_SRC clojure
(def all-tile-edges
  {:water {:n :water :ne :water :e :water :se :water :s :water :sw :water :w :water :nw :water}
   :grass {:n :grass :ne :grass :e :grass :se :grass :s :grass :sw :grass :w :grass :nw :grass}
   :grass-coast-n {:n :grass :ne :grass :e :water :se :water :s :water :sw :water :w :water :nw :grass}
   :grass-coast-e {:n :water :ne :grass :e :grass :se :grass :s :water :sw :water :w :water :nw :water}
   :grass-coast-s {:n :water :ne :water :e :water :se :grass :s :grass :sw :grass :w :water :nw :water}
   :grass-coast-w {:n :water :ne :water :e :water :se :water :s :water :sw :grass :w :grass :nw :grass}
   :grass-coast-ne-corner {:n :water :ne :grass :e :water :se :water :s :water :sw :water :w :water :nw :water}
   :grass-coast-nw-corner {:n :water :ne :water :e :water :se :water :s :water :sw :water :w :water :nw :grass}
   :grass-coast-se-corner {:n :water :ne :water :e :water :se :grass :s :water :sw :water :w :water :nw :water}
   :grass-coast-sw-corner {:n :water :ne :water :e :water :se :water :s :water :sw :grass :w :water :nw :water}
   :grass-coast-n+e {:n :grass :ne :grass :e :grass :se :grass :s :water :sw :water :w :water :nw :grass}
   :grass-coast-n+w {:n :grass :ne :grass :e :water :se :water :s :water :sw :grass :w :grass :nw :grass}
   :grass-coast-s+e {:n :water :ne :grass :e :grass :se :grass :s :grass :sw :grass :w :water :nw :water}
   :grass-coast-s+w {:n :water :ne :water :e :water :se :grass :s :grass :sw :grass :w :grass :nw :grass}})

(def edge->sockets
  {:n {:n :s :nw :sw :ne :se}
   :s {:s :n :sw :nw :se :ne}
   :e {:e :w :se :sw :ne :nw}
   :w {:w :e :sw :se :nw :ne}
   :ne {:ne :sw}
   :sw {:sw :ne}
   :nw {:nw :se}
   :se {:se :nw}})

(def invert-direction
  {:n :s
   :s :n
   :e :w
   :w :e
   :ne :sw
   :sw :ne
   :se :nw
   :nw :se})

(defn adjacent-tile-valid-sockets [input-tile-edges edge]
  (let [required-sockets (edge->sockets edge)]
    (->>
     (for [[from-edge to-edge] required-sockets]
       (let [tile-edge-type (from-edge input-tile-edges)]
         [to-edge tile-edge-type]))
     (into {}))))

(defn valid-tiles [valid-sockets tile-edges]
  (->> tile-edges
       (filter
        (fn [[_ edges]]
          (set/subset? (set valid-sockets)
                       (set edges))))
       (map first)
       set))

(def all-tile-types (keys tile-paths))
#+END_SRC

