public/wfc.html


<div id="outline-container-orgddcd02b" class="outline-2">
<h2 id="orgddcd02b">Adjacency rules</h2>
<div class="outline-text-2" id="text-orgddcd02b">
<p>
We need a set of rules to see which tiles are allowed to go next to which. This can become quite painstaking if you do it by hand. The original WFC project has a tool to analyse existing valid maps and extract rules from them. Here we only have a few tiles and I don't have any example maps, so I've used a "sockets" approach whereby we match up tile types based on the content at positions on the corresponding edges of the tiles.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">all-tile-edges</span>
  <span style="color: #ff62d4;">{</span><span style="color: #00bcff;">:water</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-n</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-e</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-s</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-w</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-ne-corner</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-nw-corner</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-se-corner</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-sw-corner</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-n+e</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-n+w</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-s+e</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:water</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:grass-coast-s+w</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:water</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:grass</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:grass</span><span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">}</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">edge-&gt;sockets</span>
  <span style="color: #ff62d4;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:se</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:s</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:ne</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:e</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:nw</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:w</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:ne</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:ne</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:sw</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:sw</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:ne</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:nw</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:se</span><span style="color: #3fdfd0;">}</span>
   <span style="color: #00bcff;">:se</span> <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:nw</span><span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">}</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">invert-direction</span>
  <span style="color: #ff62d4;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #00bcff;">:s</span>
   <span style="color: #00bcff;">:s</span> <span style="color: #00bcff;">:n</span>
   <span style="color: #00bcff;">:e</span> <span style="color: #00bcff;">:w</span>
   <span style="color: #00bcff;">:w</span> <span style="color: #00bcff;">:e</span>
   <span style="color: #00bcff;">:ne</span> <span style="color: #00bcff;">:sw</span>
   <span style="color: #00bcff;">:sw</span> <span style="color: #00bcff;">:ne</span>
   <span style="color: #00bcff;">:se</span> <span style="color: #00bcff;">:nw</span>
   <span style="color: #00bcff;">:nw</span> <span style="color: #00bcff;">:se</span><span style="color: #ff62d4;">}</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">adjacent-tile-valid-sockets</span> <span style="color: #ff62d4;">[</span>input-tile-edges edge<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>required-sockets <span style="color: #fba849;">(</span>edge-&gt;sockets edge<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">-&gt;&gt;</span>
     <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">for</span> <span style="color: #9f80ff;">[</span><span style="color: #4fe42f;">[</span>from-edge to-edge<span style="color: #4fe42f;">]</span> required-sockets<span style="color: #9f80ff;">]</span>
       <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #4fe42f;">[</span>tile-edge-type <span style="color: #fe6060;">(</span>from-edge input-tile-edges<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">]</span>
         <span style="color: #4fe42f;">[</span>to-edge tile-edge-type<span style="color: #4fe42f;">]</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
     <span style="color: #fba849;">(</span>into <span style="color: #9f80ff;">{}</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">valid-tiles</span> <span style="color: #ff62d4;">[</span>valid-sockets tile-edges<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">-&gt;&gt;</span> tile-edges
       <span style="color: #3fdfd0;">(</span>filter
        <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">fn</span> <span style="color: #9f80ff;">[</span><span style="color: #4fe42f;">[</span>_ edges<span style="color: #4fe42f;">]</span><span style="color: #9f80ff;">]</span>
          <span style="color: #9f80ff;">(</span><span style="color: #6ae4b9;">set</span>/subset? <span style="color: #4fe42f;">(</span>set valid-sockets<span style="color: #4fe42f;">)</span>
                       <span style="color: #4fe42f;">(</span>set edges<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
       <span style="color: #3fdfd0;">(</span>map first<span style="color: #3fdfd0;">)</span>
       set<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">def</span> <span style="color: #00d3d0;">all-tile-types</span> <span style="color: #ff62d4;">(</span>keys tile-paths<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
