content/wfc.org
* Applying the rules
Each cell will start with a complete set of possible tile types. For each iteration we will resolve one of the tiles with the lowest number of possible types. Then we need to update its neighbours since it will have an impact on what values are still possible for the neighbours.

Sometimes a tile will resolve automatically by only having one tile type left. This is fine, but it means we just need to re-check the neighbours of the tile we are about to resolve to see if any of its neighbours have been automatically resolved.

All of the below has been written with a flagrant disregard for performance.

#+BEGIN_SRC clojure
 
(defn init-grid [width]
  (vec
   (take (* width width)
         (repeat (set all-tile-types)))))

(defn find-lowest-entropy-idx [grid]
  (some->> grid
           (map-indexed (fn [idx poss-vals]
                          [idx (count poss-vals)]))
           shuffle
           (sort-by second)
           (drop-while #(< (second %) 2))
           first
           first))

(defn find-neighbours [grid-width idx]
  (let [first-row? (< idx grid-width)
        first-in-row? (zero? (mod idx grid-width))
        last-in-row? (= (dec grid-width)
                        (mod idx grid-width))
        last-row? (>= idx (* grid-width
                             (dec grid-width)))]
    (->>
     {:n (when-not first-row?
           (- idx grid-width))
      :ne (when-not
           (or first-row? last-in-row?)
            (- idx (dec grid-width)))
      :e (when-not last-in-row? (inc idx))
      :se (when-not (or last-in-row? last-row?)
            (+ idx grid-width 1))
      :s (when-not last-row?
           (+ idx grid-width))
      :sw (when-not (or first-in-row? last-row?)
            (+ idx grid-width -1))
      :w (when-not first-in-row?
           (dec idx))
      :nw (when-not (or first-row? first-in-row?)
            (- idx (inc grid-width)))}
     (filter val)
     (into {}))))

(defn remaining-possibilities
  [grid-width grid idx]
  (let [neighbours (find-neighbours grid-width idx)
        prev-possibilities (nth grid idx)
        possibilities-from-resolved-neighbours
        (->>
         (for [[direction nei-idx] neighbours
               :let [nei (nth grid nei-idx)]
               :when (= (count nei) 1)
               :let [nei-type (-> nei vec first)
                     nei-tile-edges (all-tile-edges nei-type)
                     valid-sockets (adjacent-tile-valid-sockets
                                    nei-tile-edges
                                    (invert-direction direction))]]
           (valid-tiles valid-sockets all-tile-edges))
         (apply set/intersection))]
    (or possibilities-from-resolved-neighbours
        prev-possibilities)))

(defn update-cell-reducer-fn [grid-width]
  (fn [grid idx]
    (let [prev-types (nth grid idx)]
      (if (= 1 (count prev-types))
        grid
        (assoc grid idx
               (remaining-possibilities grid-width grid idx))))))

(defn update-neighbours [grid grid-width idx]
  (let [neighbours (find-neighbours grid-width idx)]
    (reduce (update-cell-reducer-fn grid-width)
            grid
            (vals neighbours))))

(defn resolve-tile [possible-values]
  (->> possible-values
       vec
       shuffle
       (take 1)
       set))

(defn iterate-grid [grid-width {:keys [grid finished?]}]
  (let [lowest-entropy-idx (find-lowest-entropy-idx grid)]
    (if (or finished? (not lowest-entropy-idx))
      {:finished? true
       :grid grid}
      {:finished? false
       :grid (-> grid
                 (assoc lowest-entropy-idx
                        (resolve-tile
                         (remaining-possibilities grid-width
                                                  grid
                                                  lowest-entropy-idx)))
                 (update-neighbours grid-width lowest-entropy-idx))}))) 
#+END_SRC

