public/wfc.html

<div id="outline-container-orge1a9ecd" class="outline-2">
<h2 id="orge1a9ecd">Applying the rules</h2>
<div class="outline-text-2" id="text-orge1a9ecd">
<p>
Each cell will start with a complete set of possible tile types. For each iteration we will resolve one of the tiles with the lowest number of possible types. Then we need to update its neighbours since it will have an impact on what values are still possible for the neighbours.
</p>

<p>
Sometimes a tile will resolve automatically by only having one tile type left. This is fine, but it means we just need to re-check the neighbours of the tile we are about to resolve to see if any of its neighbours have been automatically resolved.
</p>

<p>
All of the below has been written with a flagrant disregard for performance.
</p>

<div class="org-src-container">
<pre class="src src-clojure">
<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">init-grid</span> <span style="color: #ff62d4;">[</span>width<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span>vec
   <span style="color: #3fdfd0;">(</span>take <span style="color: #fba849;">(</span>* width width<span style="color: #fba849;">)</span>
         <span style="color: #fba849;">(</span>repeat <span style="color: #9f80ff;">(</span>set all-tile-types<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">find-lowest-entropy-idx</span> <span style="color: #ff62d4;">[</span>grid<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">some-&gt;&gt;</span> grid
           <span style="color: #3fdfd0;">(</span>map-indexed <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">fn</span> <span style="color: #9f80ff;">[</span>idx poss-vals<span style="color: #9f80ff;">]</span>
                          <span style="color: #9f80ff;">[</span>idx <span style="color: #4fe42f;">(</span>count poss-vals<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">]</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
           shuffle
           <span style="color: #3fdfd0;">(</span>sort-by second<span style="color: #3fdfd0;">)</span>
           <span style="color: #3fdfd0;">(</span>drop-while #<span style="color: #fba849;">(</span>&lt; <span style="color: #9f80ff;">(</span>second <span style="color: #00d3d0;">%</span><span style="color: #9f80ff;">)</span> 2<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span>
           first
           first<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">find-neighbours</span> <span style="color: #ff62d4;">[</span>grid-width idx<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>first-row? <span style="color: #fba849;">(</span>&lt; idx grid-width<span style="color: #fba849;">)</span>
        first-in-row? <span style="color: #fba849;">(</span>zero? <span style="color: #9f80ff;">(</span>mod idx grid-width<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
        last-in-row? <span style="color: #fba849;">(</span>= <span style="color: #9f80ff;">(</span>dec grid-width<span style="color: #9f80ff;">)</span>
                        <span style="color: #9f80ff;">(</span>mod idx grid-width<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
        last-row? <span style="color: #fba849;">(</span>&gt;= idx <span style="color: #9f80ff;">(</span>* grid-width
                             <span style="color: #4fe42f;">(</span>dec grid-width<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">-&gt;&gt;</span>
     <span style="color: #fba849;">{</span><span style="color: #00bcff;">:n</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> first-row?
           <span style="color: #4fe42f;">(</span>- idx grid-width<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:ne</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span>
           <span style="color: #4fe42f;">(</span><span style="color: #b6a0ff;">or</span> first-row? last-in-row?<span style="color: #4fe42f;">)</span>
            <span style="color: #4fe42f;">(</span>- idx <span style="color: #fe6060;">(</span>dec grid-width<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:e</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> last-in-row? <span style="color: #4fe42f;">(</span>inc idx<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:se</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> <span style="color: #4fe42f;">(</span><span style="color: #b6a0ff;">or</span> last-in-row? last-row?<span style="color: #4fe42f;">)</span>
            <span style="color: #4fe42f;">(</span>+ idx grid-width 1<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:s</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> last-row?
           <span style="color: #4fe42f;">(</span>+ idx grid-width<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:sw</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> <span style="color: #4fe42f;">(</span><span style="color: #b6a0ff;">or</span> first-in-row? last-row?<span style="color: #4fe42f;">)</span>
            <span style="color: #4fe42f;">(</span>+ idx grid-width -1<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:w</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> first-in-row?
           <span style="color: #4fe42f;">(</span>dec idx<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
      <span style="color: #00bcff;">:nw</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">when-not</span> <span style="color: #4fe42f;">(</span><span style="color: #b6a0ff;">or</span> first-row? first-in-row?<span style="color: #4fe42f;">)</span>
            <span style="color: #4fe42f;">(</span>- idx <span style="color: #fe6060;">(</span>inc grid-width<span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">}</span>
     <span style="color: #fba849;">(</span>filter val<span style="color: #fba849;">)</span>
     <span style="color: #fba849;">(</span>into <span style="color: #9f80ff;">{}</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">remaining-possibilities</span>
  <span style="color: #ff62d4;">[</span>grid-width grid idx<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>neighbours <span style="color: #fba849;">(</span>find-neighbours grid-width idx<span style="color: #fba849;">)</span>
        prev-possibilities <span style="color: #fba849;">(</span>nth grid idx<span style="color: #fba849;">)</span>
        possibilities-from-resolved-neighbours
        <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">-&gt;&gt;</span>
         <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">for</span> <span style="color: #4fe42f;">[</span><span style="color: #fe6060;">[</span>direction nei-idx<span style="color: #fe6060;">]</span> neighbours
               <span style="color: #00bcff;">:let</span> <span style="color: #fe6060;">[</span>nei <span style="color: #4fafff;">(</span>nth grid nei-idx<span style="color: #4fafff;">)</span><span style="color: #fe6060;">]</span>
               <span style="color: #00bcff;">:when</span> <span style="color: #fe6060;">(</span>= <span style="color: #4fafff;">(</span>count nei<span style="color: #4fafff;">)</span> 1<span style="color: #fe6060;">)</span>
               <span style="color: #00bcff;">:let</span> <span style="color: #fe6060;">[</span>nei-type <span style="color: #4fafff;">(</span><span style="color: #b6a0ff;">-&gt;</span> nei vec first<span style="color: #4fafff;">)</span>
                     nei-tile-edges <span style="color: #4fafff;">(</span>all-tile-edges nei-type<span style="color: #4fafff;">)</span>
                     valid-sockets <span style="color: #4fafff;">(</span>adjacent-tile-valid-sockets
                                    nei-tile-edges
                                    <span style="color: #f0dd60;">(</span>invert-direction direction<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span><span style="color: #fe6060;">]</span><span style="color: #4fe42f;">]</span>
           <span style="color: #4fe42f;">(</span>valid-tiles valid-sockets all-tile-edges<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
         <span style="color: #9f80ff;">(</span>apply <span style="color: #6ae4b9;">set</span>/intersection<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">or</span> possibilities-from-resolved-neighbours
        prev-possibilities<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">update-cell-reducer-fn</span> <span style="color: #ff62d4;">[</span>grid-width<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">fn</span> <span style="color: #3fdfd0;">[</span>grid idx<span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #fba849;">[</span>prev-types <span style="color: #9f80ff;">(</span>nth grid idx<span style="color: #9f80ff;">)</span><span style="color: #fba849;">]</span>
      <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">if</span> <span style="color: #9f80ff;">(</span>= 1 <span style="color: #4fe42f;">(</span>count prev-types<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span>
        grid
        <span style="color: #9f80ff;">(</span>assoc grid idx
               <span style="color: #4fe42f;">(</span>remaining-possibilities grid-width grid idx<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">update-neighbours</span> <span style="color: #ff62d4;">[</span>grid grid-width idx<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>neighbours <span style="color: #fba849;">(</span>find-neighbours grid-width idx<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span>reduce <span style="color: #fba849;">(</span>update-cell-reducer-fn grid-width<span style="color: #fba849;">)</span>
            grid
            <span style="color: #fba849;">(</span>vals neighbours<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">resolve-tile</span> <span style="color: #ff62d4;">[</span>possible-values<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">-&gt;&gt;</span> possible-values
       vec
       shuffle
       <span style="color: #3fdfd0;">(</span>take 1<span style="color: #3fdfd0;">)</span>
       set<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">iterate-grid</span> <span style="color: #ff62d4;">[</span>grid-width <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:keys</span> <span style="color: #fba849;">[</span>grid finished?<span style="color: #fba849;">]</span><span style="color: #3fdfd0;">}</span><span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>lowest-entropy-idx <span style="color: #fba849;">(</span>find-lowest-entropy-idx grid<span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">if</span> <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">or</span> finished? <span style="color: #9f80ff;">(</span>not lowest-entropy-idx<span style="color: #9f80ff;">)</span><span style="color: #fba849;">)</span>
      <span style="color: #fba849;">{</span><span style="color: #00bcff;">:finished?</span> <span style="color: #00bcff;">true</span>
       <span style="color: #00bcff;">:grid</span> grid<span style="color: #fba849;">}</span>
      <span style="color: #fba849;">{</span><span style="color: #00bcff;">:finished?</span> <span style="color: #00bcff;">false</span>
       <span style="color: #00bcff;">:grid</span> <span style="color: #9f80ff;">(</span><span style="color: #b6a0ff;">-&gt;</span> grid
                 <span style="color: #4fe42f;">(</span>assoc lowest-entropy-idx
                        <span style="color: #fe6060;">(</span>resolve-tile
                         <span style="color: #4fafff;">(</span>remaining-possibilities grid-width
                                                  grid
                                                  lowest-entropy-idx<span style="color: #4fafff;">)</span><span style="color: #fe6060;">)</span><span style="color: #4fe42f;">)</span>
                 <span style="color: #4fe42f;">(</span>update-neighbours grid-width lowest-entropy-idx<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">)</span><span style="color: #fba849;">}</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span> 
</pre>
</div>
</div>
