content/wfc.org
** displaying it
Here's the plumbing used to render it here.

#+BEGIN_SRC clojure
(defn wfc-grid [n-columns grid]
  [tile-grid {:tile-width-px 16
              :n-columns n-columns}
   (map-indexed
    (fn [idx cell-possible-values]
      [tile-img
       {:idx idx
        :tile-img-path
        (if (= (count cell-possible-values) 1)
          (tile-paths (-> cell-possible-values vec first))
          empty-tile)
        :width-px 16}])
    grid)])

(defn interactive-map [n-columns]
  (let [state (r/atom {:grid (init-grid n-columns)
                       :finished? false})]
    (fn [_]
      [:div
       [wfc-grid n-columns (:grid @state)]
       [:div {:style {:display "flex"}}
        [:p [:button
             {:on-click #(swap! state
                                (partial iterate-grid n-columns))}
             "iterate"]]
        [:p [:button
             {:on-click #(while (not (:finished? @state))
                           (swap! state
                                  (partial iterate-grid n-columns)))}
             "finish"]]
        [:p [:button
             {:on-click #(reset! state
                                 {:grid (init-grid n-columns)
                                  :finished? false})}
             "reset"]]]])))

(rdom/render
 [interactive-map 20]
 (.getElementById js/document "interactive-map"))

#+END_SRC

#+BEGIN_EXPORT html
<body>
  <div id="interactive-map"></div>
</body>
#+END_EXPORT

* What next
The above would be improved by having weightings for the tile types, maybe making land tiles more likely. Adding more different tiles would also be fun.
