public/wfc.html

<div id="outline-container-org5d7a90e" class="outline-3">
<h3 id="org5d7a90e">displaying it</h3>
<div class="outline-text-3" id="text-org5d7a90e">
<p>
Here's the plumbing used to render it here.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">wfc-grid</span> <span style="color: #ff62d4;">[</span>n-columns grid<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">[</span>tile-grid <span style="color: #3fdfd0;">{</span><span style="color: #00bcff;">:tile-width-px</span> 16
              <span style="color: #00bcff;">:n-columns</span> n-columns<span style="color: #3fdfd0;">}</span>
   <span style="color: #3fdfd0;">(</span>map-indexed
    <span style="color: #fba849;">(</span><span style="color: #b6a0ff;">fn</span> <span style="color: #9f80ff;">[</span>idx cell-possible-values<span style="color: #9f80ff;">]</span>
      <span style="color: #9f80ff;">[</span>tile-img
       <span style="color: #4fe42f;">{</span><span style="color: #00bcff;">:idx</span> idx
        <span style="color: #00bcff;">:tile-img-path</span>
        <span style="color: #fe6060;">(</span><span style="color: #b6a0ff;">if</span> <span style="color: #4fafff;">(</span>= <span style="color: #f0dd60;">(</span>count cell-possible-values<span style="color: #f0dd60;">)</span> 1<span style="color: #4fafff;">)</span>
          <span style="color: #4fafff;">(</span>tile-paths <span style="color: #f0dd60;">(</span><span style="color: #b6a0ff;">-&gt;</span> cell-possible-values vec first<span style="color: #f0dd60;">)</span><span style="color: #4fafff;">)</span>
          empty-tile<span style="color: #fe6060;">)</span>
        <span style="color: #00bcff;">:width-px</span> 16<span style="color: #4fe42f;">}</span><span style="color: #9f80ff;">]</span><span style="color: #fba849;">)</span>
    grid<span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">]</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">interactive-map</span> <span style="color: #ff62d4;">[</span>n-columns<span style="color: #ff62d4;">]</span>
  <span style="color: #ff62d4;">(</span><span style="color: #b6a0ff;">let</span> <span style="color: #3fdfd0;">[</span>state <span style="color: #fba849;">(</span><span style="color: #6ae4b9;">r</span>/atom <span style="color: #9f80ff;">{</span><span style="color: #00bcff;">:grid</span> <span style="color: #4fe42f;">(</span>init-grid n-columns<span style="color: #4fe42f;">)</span>
                       <span style="color: #00bcff;">:finished?</span> <span style="color: #00bcff;">false</span><span style="color: #9f80ff;">}</span><span style="color: #fba849;">)</span><span style="color: #3fdfd0;">]</span>
    <span style="color: #3fdfd0;">(</span><span style="color: #b6a0ff;">fn</span> <span style="color: #fba849;">[</span>_<span style="color: #fba849;">]</span>
      <span style="color: #fba849;">[</span><span style="color: #00bcff;">:div</span>
       <span style="color: #9f80ff;">[</span>wfc-grid n-columns <span style="color: #4fe42f;">(</span><span style="color: #00bcff;">:grid</span> @state<span style="color: #4fe42f;">)</span><span style="color: #9f80ff;">]</span>
       <span style="color: #9f80ff;">[</span><span style="color: #00bcff;">:div</span> <span style="color: #4fe42f;">{</span><span style="color: #00bcff;">:style</span> <span style="color: #fe6060;">{</span><span style="color: #00bcff;">:display</span> <span style="color: #79a8ff;">"flex"</span><span style="color: #fe6060;">}</span><span style="color: #4fe42f;">}</span>
        <span style="color: #4fe42f;">[</span><span style="color: #00bcff;">:p</span> <span style="color: #fe6060;">[</span><span style="color: #00bcff;">:button</span>
             <span style="color: #4fafff;">{</span><span style="color: #00bcff;">:on-click</span> #<span style="color: #f0dd60;">(</span>swap! state
                                <span style="color: #ffffff;">(</span>partial iterate-grid n-columns<span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">}</span>
             <span style="color: #79a8ff;">"iterate"</span><span style="color: #fe6060;">]</span><span style="color: #4fe42f;">]</span>
        <span style="color: #4fe42f;">[</span><span style="color: #00bcff;">:p</span> <span style="color: #fe6060;">[</span><span style="color: #00bcff;">:button</span>
             <span style="color: #4fafff;">{</span><span style="color: #00bcff;">:on-click</span> #<span style="color: #f0dd60;">(</span><span style="color: #b6a0ff;">while</span> <span style="color: #ffffff;">(</span>not <span style="color: #ff62d4;">(</span><span style="color: #00bcff;">:finished?</span> @state<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>
                           <span style="color: #ffffff;">(</span>swap! state
                                  <span style="color: #ff62d4;">(</span>partial iterate-grid n-columns<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">}</span>
             <span style="color: #79a8ff;">"finish"</span><span style="color: #fe6060;">]</span><span style="color: #4fe42f;">]</span>
        <span style="color: #4fe42f;">[</span><span style="color: #00bcff;">:p</span> <span style="color: #fe6060;">[</span><span style="color: #00bcff;">:button</span>
             <span style="color: #4fafff;">{</span><span style="color: #00bcff;">:on-click</span> #<span style="color: #f0dd60;">(</span>reset! state
                                 <span style="color: #ffffff;">{</span><span style="color: #00bcff;">:grid</span> <span style="color: #ff62d4;">(</span>init-grid n-columns<span style="color: #ff62d4;">)</span>
                                  <span style="color: #00bcff;">:finished?</span> <span style="color: #00bcff;">false</span><span style="color: #ffffff;">}</span><span style="color: #f0dd60;">)</span><span style="color: #4fafff;">}</span>
             <span style="color: #79a8ff;">"reset"</span><span style="color: #fe6060;">]</span><span style="color: #4fe42f;">]</span><span style="color: #9f80ff;">]</span><span style="color: #fba849;">]</span><span style="color: #3fdfd0;">)</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">rdom</span>/render
 <span style="color: #ff62d4;">[</span>interactive-map 20<span style="color: #ff62d4;">]</span>
 <span style="color: #ff62d4;">(</span>.getElementById <span style="color: #6ae4b9;">js</span>/document <span style="color: #79a8ff;">"interactive-map"</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

</pre>
</div>

<body>
  <div id="interactive-map"></div>
</body>
</div>
</div>
</div>

<div id="outline-container-orgd24ef25" class="outline-2">
<h2 id="orgd24ef25">What next</h2>
<div class="outline-text-2" id="text-orgd24ef25">
<p>
The above would be improved by having weightings for the tile types, maybe making land tiles more likely. Adding more different tiles would also be fun.
</p>
</div>
</div>
</div>
</body>
</html>
